In [1]:
import random

import pandas as pd
import numpy as np
from numpy.ma.core import reshape
from numpy.random import randn

In [5]:
s=pd.Series([1,2,3,4,5,6],index=[10,20,30,40,50,60])
s

10    1
20    2
30    3
40    4
50    5
60    6
dtype: int64

In [7]:
a=[1,2,3,4,5]
s=pd.Series(a)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
dict={
    'name':['aaa','bbb','ccc','ddd'],
    'age':[10,20,30,40],
    'salary':[5000,6000,3000,1000]
}
df=pd.DataFrame(dict,index=['a','b','c','d'])
df.rename(columns={'name':'full name','age':'number','salary':'amount'})

  full name  number  amount
a       aaa      10    5000
b       bbb      20    6000
c       ccc      30    3000
d       ddd      40    1000

In [15]:
a=[[1,2,3,4,5],[6,6,9,8,7]]
df=pd.DataFrame(a)
df

   0  1  2  3  4
0  1  2  3  4  5
1  6  6  9  8  7

In [34]:
s=pd.Series(range(1,10))
print(s)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [84]:
df=pd.DataFrame(np.random.randn(5,6),index='A B C D F'.split())
print(df)
print(df.loc['A':'B'])
print(df.iloc[1:4])

          0         1         2         3         4         5
A  1.104985 -1.325613  0.192386  1.147615 -0.662396 -1.032515
B -0.991267  1.568725  2.433408 -2.101520  0.765805 -0.439865
C -0.315256  0.609410  0.508178  0.209368  0.342831  0.624859
D  1.716480  0.466906  1.588945  0.890558  2.060543 -1.181125
F -0.870250  1.116044 -0.819352 -1.758346 -0.025371 -1.859311
          0         1         2         3         4         5
A  1.104985 -1.325613  0.192386  1.147615 -0.662396 -1.032515
B -0.991267  1.568725  2.433408 -2.101520  0.765805 -0.439865
          0         1         2         3         4         5
B -0.991267  1.568725  2.433408 -2.101520  0.765805 -0.439865
C -0.315256  0.609410  0.508178  0.209368  0.342831  0.624859
D  1.716480  0.466906  1.588945  0.890558  2.060543 -1.181125

In [90]:
data={
    "num":[10,20,30,40],
    "num2":[20,55,66,70]
}
df=pd.DataFrame(data)
print(df)
df['num3']=df['num'] * df['num2']
df
df["squre"]=df['num3']**2
df

   num  num2
0   10    20
1   20    55
2   30    66
3   40    70

   num  num2  num3    squre
0   10    20   200    40000
1   20    55  1100  1210000
2   30    66  1980  3920400
3   40    70  2800  7840000

In [104]:
dict={
    'name':['aaa','bbb','ccc','ddd'],
    'age':[10,20,30,40],
    'salary':[5000,6000,3000,1000]
}
df=pd.DataFrame(dict)
print(df)
d=df['name']
print(d)
f=df.nlargest(2,['age'])
print(f)
s=df.nsmallest(2,["salary"])
s

  name  age  salary
0  aaa   10    5000
1  bbb   20    6000
2  ccc   30    3000
3  ddd   40    1000
0    aaa
1    bbb
2    ccc
3    ddd
Name: name, dtype: object

  name  age  salary
3  ddd   40    1000
2  ccc   30    3000

In [122]:
dict={
    'name':['aaa','bbb','acc','ddd'],
    'age':[10,20,30,40],
    'salary':[5000,6000,3000,1000]
}
df=pd.DataFrame(dict)
d=df[df['age']>20]
print(d)
a=df[df['salary'].isin([1000])]
print(a)
l=df[df['salary'].between(3000,7000)]
print(l)
n=df[df['name'].str.startswith('a')]
print(n)

  name  age  salary
2  acc   30    3000
3  ddd   40    1000
  name  age  salary
3  ddd   40    1000
  name  age  salary
0  aaa   10    5000
1  bbb   20    6000
2  acc   30    3000
  name  age  salary
0  aaa   10    5000
2  acc   30    3000

In [154]:
dict={
    'name':['aaa','bbb','acc','ddd'],
    'age':[10,None,30,40],
    'salary':[5000,6000,None,1000]
}
df=pd.DataFrame(dict)
a=df.dropna()
print(a)
b=df.isnull
print(b)
# c=df.fillna(20)
# print(c)
# e=df['age'].mean()
# h=df.fillna(e)
# print(h)
r=df['salary'].max()
j=df.fillna(r)
print(j)
g=df.ffill()
print(g)
# t=df['age']=df['age'].fillna(df['age'].mean())
# print(t)

  name   age  salary
0  aaa  10.0  5000.0
3  ddd  40.0  1000.0
<bound method DataFrame.isnull of   name   age  salary
0  aaa  10.0  5000.0
1  bbb   NaN  6000.0
2  acc  30.0     NaN
3  ddd  40.0  1000.0>
  name     age  salary
0  aaa    10.0  5000.0
1  bbb  6000.0  6000.0
2  acc    30.0  6000.0
3  ddd    40.0  1000.0
  name   age  salary
0  aaa  10.0  5000.0
1  bbb  10.0  6000.0
2  acc  30.0  6000.0
3  ddd  40.0  1000.0

In [6]:
import pandas as pd
dict={
    'name':['aaa','bbb','acc','ddd'],
    'age':[10,None,50,40],
    'salary':[5000,6000,None,1000]
}
df=pd.DataFrame(dict)
print(df)
s=df['age'].sort_values()
print(s)
a=s.nlargest(2)
print(a)
d=df.sort_values(['age','salary'],ascending=[True,False])
print(d)
# print(df.sort_values(['age'],ascending=True))
# df.head(2)
# df.tail(2)

  name   age  salary
0  aaa  10.0  5000.0
1  bbb   NaN  6000.0
2  acc  50.0     NaN
3  ddd  40.0  1000.0
0    10.0
3    40.0
2    50.0
1     NaN
Name: age, dtype: float64
2    50.0
3    40.0
Name: age, dtype: float64
  name   age  salary
0  aaa  10.0  5000.0
3  ddd  40.0  1000.0
2  acc  50.0     NaN
1  bbb   NaN  6000.0

In [11]:
#groupe
data1={
    "department":["HR",'DATA','HR','IT','IT','HR'],
    'name':['aaa','bbb','ccc','ddd','eee','fff'],
    'salary':[80000,60000,3000,10000,55000,25000],
    'bonus':[10000,55000,25000,30000,45000,35000],
}
df=pd.DataFrame(data1)
print(df)
g=df.groupby('department')['salary'].agg(['sum','mean','std'])
print(g)

  department name  salary  bonus
0         HR  aaa   80000  10000
1       DATA  bbb   60000  55000
2         HR  ccc    3000  25000
3         IT  ddd   10000  30000
4         IT  eee   55000  45000
5         HR  fff   25000  35000
               sum     mean           std
department
DATA         60000  60000.0           NaN
HR          108000  36000.0  39661.064030
IT           65000  32500.0  31819.805153

In [18]:
data1={
    "department":["HR",'DATA','HR','IT','IT','HR'],
    'name':['aaa','bbb','ccc','ddd','eee','fff'],
    'salary':[80000,60000,3000,10000,55000,25000],
    'bonus':[10000,55000,25000,30000,45000,35000],
}
data2={
    "department":["HR",'DATA','HR','IT','IT','HR'],
    'name':['aaa','bbb','ccc','ddd','eee','fff'],
    'salary':[80000,60000,3000,10000,55000,25000],
    'bonus':[10000,55000,25000,30000,45000,35000],
}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(pd.concat([df1,df2],axis=1))
print(pd.merge(df1,df2,on=["department","salary"] ))

  department name  salary  bonus department name  salary  bonus
0         HR  aaa   80000  10000         HR  aaa   80000  10000
1       DATA  bbb   60000  55000       DATA  bbb   60000  55000
2         HR  ccc    3000  25000         HR  ccc    3000  25000
3         IT  ddd   10000  30000         IT  ddd   10000  30000
4         IT  eee   55000  45000         IT  eee   55000  45000
5         HR  fff   25000  35000         HR  fff   25000  35000
  department name_x  salary  bonus_x name_y  bonus_y
0         HR    aaa   80000    10000    aaa    10000
1       DATA    bbb   60000    55000    bbb    55000
2         HR    ccc    3000    25000    ccc    25000
3         IT    ddd   10000    30000    ddd    30000
4         IT    eee   55000    45000    eee    45000
5         HR    fff   25000    35000    fff    35000

In [27]:
data1={
    "department":["HR",'DATA','HR','IT','IT','HR'],
    'name':['aaa','bbb','ccc','ddd','eee','fff'],
    'salary':[80000,60000,3000,10000,55000,25000],
    'bonus':[10000,55000,25000,30000,45000,35000],
}
df=pd.DataFrame(data1)
g=df.groupby('department')["salary"].sum()
print(g)
c=df.groupby('salary')["department"].sum()
print(c)
df['salary']=df['salary'].astype('float')
df

department
DATA     60000
HR      108000
IT       65000
Name: salary, dtype: int64
salary
3000       HR
10000      IT
25000      HR
55000      IT
60000    DATA
80000      HR
Name: department, dtype: object

  department name   salary  bonus
0         HR  aaa  80000.0  10000
1       DATA  bbb  60000.0  55000
2         HR  ccc   3000.0  25000
3         IT  ddd  10000.0  30000
4         IT  eee  55000.0  45000
5         HR  fff  25000.0  35000